def test():
    """
    以 java 的思想来理解，
    可以理解为数组中每个元素都指向同一对象
    如果是引用类型，那个修改其中某个元素，所有元素都会变化
    = 赋值相同于指向别的对象，因此不影响其他元素

    因此如果想创建二维数组，需要
    [[0] * n for _ in range(n)]
    """
    # []
    print([] * 5)
    # [0, 0, 0, 0, 0]
    print([0] * 5)
    # [[], [], [], [], []]
    print([[]] * 5)
    # [[0], [0], [0], [0], [0]]
    print([[0]] * 5)
    a = [[0] * 5] * 5
    # [[0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0]]
    print(a)
    a[0] = [1, 2]
    # [[1, 2], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0], [0, 0, 0, 0, 0]]
    print(a)
    a[1][1] = 2
    # [[1, 2], [0, 2, 0, 0, 0], [0, 2, 0, 0, 0], [0, 2, 0, 0, 0], [0, 2, 0, 0, 0]]
    print(a)


if __name__ == '__main__':
    test()
